---
kind: method
id: M:Autodesk.Revit.DB.FabricationConfiguration.GetMaterialName(System.Int32)
source: html/828e75ce-67c4-be63-65a0-d547c2541d21.htm
---
# Autodesk.Revit.DB.FabricationConfiguration.GetMaterialName Method

Gets material name from its identifier.

## Syntax (C#)
```csharp
public string GetMaterialName(
	int materialId
)
```

## Parameters
- **materialId** (`System.Int32`) - The material identifier.

## Returns
The material name without the group.